app/Controllers/Dashboard.php

SELECT *
FROM `users`
---
    public function showUsers()
    {
        $data   =   [
            'users' =>  $this->userModel->findAll()
        ];