app/Controllers/ProductController.php

    public function showProducts()
    {
        $data   =   [
            'products'  =>  $this->productModel->findAll()
        ];
---
SELECT *
FROM `products`

                    'price'      =>  $this->request->getVar( 'qtyFrm' ),
                ];

                $this->productModel->save( $newData );
---
INSERT INTO `products` (`name`, `quantity`, `price`) VALUES ('Dell Optiplex', '2346', '13')